In [1]:
from sqlalchemy import create_engine
import pandas as pd
import pymysql
import keyring

In [2]:
engine = create_engine(keyring.get_password("aws", "database"))

To test the incremental value, a table with fewer rows is uploaded

In [4]:
query = 'SELECT count(*) FROM Customers'
example = pd.read_sql_query(query, con=engine)
example

   count(*)
0     89999

In [7]:
query = 'SELECT * FROM Audit'
example = pd.read_sql_query(query, con=engine)
example

,timestamp,table_name,last_modified_dataset,new_rows,rows_range,detail
0,2023-01-31 11:24:06,Closed_deals,2023-01-29 18:56:12,842,0 - 841,Creation of table and data load
1,2023-01-31 11:24:09,Customers,2023-01-31 14:15:31,89999,0 - 89998,Creation of table and data load
2,2023-01-31 11:24:30,Geolocation,2023-01-26 19:59:06,738332,0 - 738331,Creation of table and data load
3,2023-01-31 11:24:31,Marketing,2023-01-18 07:47:17,8000,0 - 7999,Creation of table and data load
4,2023-01-31 11:24:36,Order_items,2023-01-18 07:47:25,112650,0 - 112649,Creation of table and data load
5,2023-01-31 11:24:38,Order_payments,2023-01-18 07:47:34,103886,0 - 103885,Creation of table and data load
6,2023-01-31 11:24:42,Order_reviews,2023-01-18 07:47:39,99224,0 - 99223,Creation of table and data load
7,2023-01-31 11:24:43,Sellers,2023-01-26 16:18:48,3095,0 - 3094,Creation of table and data load
8,2023-01-31 11:24:44,Products,2023-01-18 07:47:44,32951,0 - 32950,Creation of table and data load
9,2023-01-31 11:24:48,Orders,2023-01-18 07:47:08,99441,0 - 99440,Creation of table and data load
10,2023-01-31 11:24:49,Evaluation,2023-01-31 11:24:06,2957,0 - 2956,Creation of table and data load

After the query, the original file is loaded in S3, so the DAG will upload all the new data in the tables

In [8]:
query = 'SELECT count(*) FROM Customers'
example = pd.read_sql_query(query, con=engine)
example

   count(*)
0     99441

In [9]:
query = 'SELECT * FROM Audit'
example = pd.read_sql_query(query, con=engine)
example

,timestamp,table_name,last_modified_dataset,new_rows,rows_range,detail
0,2023-01-31 11:24:06,Closed_deals,2023-01-29 18:56:12,842,0 - 841,Creation of table and data load
1,2023-01-31 11:24:09,Customers,2023-01-31 14:15:31,89999,0 - 89998,Creation of table and data load
2,2023-01-31 11:24:30,Geolocation,2023-01-26 19:59:06,738332,0 - 738331,Creation of table and data load
3,2023-01-31 11:24:31,Marketing,2023-01-18 07:47:17,8000,0 - 7999,Creation of table and data load
4,2023-01-31 11:24:36,Order_items,2023-01-18 07:47:25,112650,0 - 112649,Creation of table and data load
5,2023-01-31 11:24:38,Order_payments,2023-01-18 07:47:34,103886,0 - 103885,Creation of table and data load
6,2023-01-31 11:24:42,Order_reviews,2023-01-18 07:47:39,99224,0 - 99223,Creation of table and data load
7,2023-01-31 11:24:43,Sellers,2023-01-26 16:18:48,3095,0 - 3094,Creation of table and data load
8,2023-01-31 11:24:44,Products,2023-01-18 07:47:44,32951,0 - 32950,Creation of table and data load
9,2023-01-31 11:24:48,Orders,2023-01-18 07:47:08,99441,0 - 99440,Creation of table and data load
10,2023-01-31 11:24:49,Evaluation,2023-01-31 11:24:06,2957,0 - 2956,Creation of table and data load
11,2023-01-31 11:28:06,Customers,2023-01-31 14:26:36,9442,89999 - 99440,Adding new data to table

As we can see, the incremental value is working successfully